Revit 2027 API
AdvancedMetal.SurfaceAnisotropy Property
 The property labeled "Anisotropy" from the "AdvancedMetal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SurfaceAnisotropy { get; }
Public Shared ReadOnly Property SurfaceAnisotropy As String
	Get
public:
static property String^ SurfaceAnisotropy {
	String^ get ();
}
static member SurfaceAnisotropy : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble". This property allows a connected asset.
See Also
Reference
AdvancedMetal Class
Autodesk.Revit.DB.Visual Namespace